# Pandas Day 1

## Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## How to get Pandas Version

In [2]:
# Print only the version of pandas
print(pd.__version__)
print("-------------------------")
# Print the versions of all dependencies
pd.show_versions()

2.2.3
-------------------------

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.13.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 69 Stepping 1, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.3
numpy                 : 2.1.3
pytz                  : 2024.2
dateutil              : 2.9.0.post0
pip                   : 25.1.1
Cython                : None
sphinx                : None
IPython               : 8.29.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.5
lxml.etree            : None
matplotlib            : 3.9.2
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.15.2
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : 2.0.1
xlsxwriter            : None
zstandard             : None
tzdata                : 2024.2
qtpy                  : None
pyqt5                 : None

# How to make dataframe

In [3]:
data = {
    "Asad":["Range Rover Sportage","Lamborghini Urus","Rolls Royce Cullinan"],
    "Adnan":["Honda Civic","Honda Accord","Honda Civic"],
    "Aly":["Toyota Corolla","Toyota Camry","Toyota Corolla"],
}
# Create a DataFrame from the dictionary
df = pd.DataFrame(data)
# Display the first few rows of the DataFrame
df.head()

                   Asad         Adnan             Aly
0  Range Rover Sportage   Honda Civic  Toyota Corolla
1      Lamborghini Urus  Honda Accord    Toyota Camry
2  Rolls Royce Cullinan   Honda Civic  Toyota Corolla

In [4]:
# Create a DataFrame using numpy library
data2 = {
    "Name": np.array(["Asad", "Adnan", "Aly"]),
    "Car": np.array(["Range Rover Sportage", "Honda Civic", "Toyota Corolla"]),
    "Price": np.array([100000, 20000, 30000])
}
df2 = pd.DataFrame(data2)
print(df2)
print("-------------------------")
# Create a DataFrame with random numbers)
df3 = pd.DataFrame(np.random.rand(5,5), columns=list("ABCDE"))
print(df3)

    Name                   Car   Price
0   Asad  Range Rover Sportage  100000
1  Adnan           Honda Civic   20000
2    Aly        Toyota Corolla   30000
-------------------------
          A         B         C         D         E
0  0.947930  0.362078  0.419405  0.743905  0.052991
1  0.917779  0.444061  0.643134  0.789394  0.042507
2  0.200645  0.053391  0.086353  0.102250  0.146619
3  0.402860  0.705526  0.114965  0.218708  0.646226
4  0.821804  0.984580  0.600277  0.000849  0.334342

## How to Rename Columns

In [5]:
# Let's again have a look on a dataset
df.head()

                   Asad         Adnan             Aly
0  Range Rover Sportage   Honda Civic  Toyota Corolla
1      Lamborghini Urus  Honda Accord    Toyota Camry
2  Rolls Royce Cullinan   Honda Civic  Toyota Corolla

In [6]:
# Current name of columns
print(df.columns)
print("----------------")
# Rename the columns of the DataFrame
df.rename(columns={"Asad":"Asad_Dream_Cars","Adnan":"Adnan_Dream_Cars","Aly":"Aly_Dream_Cars"}, inplace=True)
print(df.head())
# Let's recheck the columns names
print(df.columns)

Index(['Asad', 'Adnan', 'Aly'], dtype='object')
----------------
        Asad_Dream_Cars Adnan_Dream_Cars  Aly_Dream_Cars
0  Range Rover Sportage      Honda Civic  Toyota Corolla
1      Lamborghini Urus     Honda Accord    Toyota Camry
2  Rolls Royce Cullinan      Honda Civic  Toyota Corolla
Index(['Asad_Dream_Cars', 'Adnan_Dream_Cars', 'Aly_Dream_Cars'], dtype='object')

# How to use Template Data

In [7]:
# Setting to display all rows
pd.set_option('display.max_rows', None)

In [8]:
# Load a Titanic dataset using seaborn
df = sns.load_dataset('titanic')
df.to_csv('titanic.csv', index=False)
# Let's have a look on the top 5 rows of titanic dataset
print("Titanic Dataset")
print(df.head(5))
print("---------------------------")
# Again load the Iris dataset using seaborn
print("Iris Dataset")
df = sns.load_dataset("iris")
df.to_csv('iris.csv', index=False)
# Let's have a look on the last 5 rows of Iris Dataset
print(df.tail(5))
print("-------------------------")
# Let's get the statistical summary of the Iris Dataset
print(df.describe())
print("-------------------------")
# Let's get the name of columns of the Iris dataset
print(df.columns)
print("-------------------------")
# Let's save the Iris dataset to a CSV file
df.to_csv("Iris.csv")
# Let's save the Iris dataset to an Excel file
df.to_excel("Iris.xlsx")
# Let's read the Iris dataset from a CSV file
df = pd.read_csv("Iris.csv")

Titanic Dataset
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
---------------------------
Iris Dataset
     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica
-------------------------
       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000
-------------------------
Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')
-------------------------

# Reverse Row Order

In [9]:
df = sns.load_dataset("titanic")
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [10]:
# Row reverse order
df = df.loc[::-1]
print(df.head())

     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
890         0       3    male  32.0      0      0   7.75        Q   Third
889         1       1    male  26.0      0      0  30.00        C   First
888         0       3  female   NaN      1      2  23.45        S   Third
887         1       1  female  19.0      0      0  30.00        S   First
886         0       2    male  27.0      0      0  13.00        S  Second

       who  adult_male deck  embark_town alive  alone
890    man        True  NaN   Queenstown    no   True
889    man        True    C    Cherbourg   yes   True
888  woman       False  NaN  Southampton    no  False
887  woman       False    B  Southampton   yes   True
886    man        True  NaN  Southampton    no   True

In [11]:
# Reset index of rows in to its original order
df = df.loc[::-1].reset_index(drop=True)
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [12]:
# Let's reverse the order of columns
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df[df.columns[::-1]]
print(df.head())

   alone alive  embark_town deck  adult_male    who  class embarked     fare  \
0  False    no  Southampton  NaN        True    man  Third        S   7.2500
1  False   yes    Cherbourg    C       False  woman  First        C  71.2833
2   True   yes  Southampton  NaN       False  woman  Third        S   7.9250
3  False   yes  Southampton    C       False  woman  First        S  53.1000
4   True    no  Southampton  NaN        True    man  Third        S   8.0500

   parch  sibsp   age     sex  pclass  survived
0      0      1  22.0    male       3         0
1      0      1  38.0  female       1         1
2      0      0  26.0  female       3         1
3      0      1  35.0  female       1         1
4      0      0  35.0    male       3         0

# Select columns from dataset on the base of datatype

In [13]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# Selecting specific columns that is numeric
df = df.select_dtypes(include=["number"])
df.columns

Index(['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [15]:
# Selecting specific columns that is object
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df.select_dtypes(include=["object"])
df.columns

Index(['sex', 'embarked', 'who', 'embark_town', 'alive'], dtype='object')

In [16]:
# Selecting specific columns that are neither a number nor an object
df = sns.load_dataset("titanic")  # Ensure df is a DataFrame
df = df.select_dtypes(exclude=["number","object"])
df.columns

Index(['class', 'adult_male', 'deck', 'alone'], dtype='object')

In [17]:
# Selecting specific columns that is boolean
df = sns.load_dataset("titanic")
df = df.select_dtypes(include=["bool"])
df.columns

Index(['adult_male', 'alone'], dtype='object')

# Convert string into numbers

In [18]:
df = pd.DataFrame({"Col_A": [1, 2, 3, 4, 5],"Col_B":["6","7","8","9","10"]})
df.head()

   Col_A Col_B
0      1     6
1      2     7
2      3     8
3      4     9
4      5    10

In [19]:
# Check the data types of the columns
df.dtypes

Col_A     int64
Col_B    object
dtype: object

In [20]:
# To Convert the data type of a column to numeric
df["Col_B"] = pd.to_numeric(df["Col_B"])
# Convert the 'Col_A' column from numeric to object (string) type
df["Col_A"] = df["Col_A"].astype("object")
# Check the data types of the columns after conversion
print(df.dtypes)

Col_A    object
Col_B     int64
dtype: object

# How to check Dataset Shape and Dimensions

In [21]:
df = sns.load_dataset("titanic")
# To check the shape of the DataFrame
print("Shape of the DataFrame:", df.shape)
# To get the information about the DataFrame
print("Information about the DataFrame:")
df.info()
# To get the number of rows and columns in the DataFrame    
print("Number of rows:", df.shape[0])
print("Number of columns:", df.shape[1])

Shape of the DataFrame: (891, 15)
Information about the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
Number of rows: 891
Number of columns: 15

# How to copy data on a clipboard in python

In [22]:


# Create a sample DataFrame
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
})

# Copy DataFrame to clipboard
df.to_clipboard(index=False)

# Now, you can paste this data into Excel or Notepad.
# To read data from clipboard back into a DataFrame:
df_from_clipboard = pd.read_clipboard()
print(df_from_clipboard)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

# Split Dataset into Two Subset

In [23]:
df = sns.load_dataset("titanic")
# Display the first few rows of the DataFrame
print(df.head())
# Shape of DataFrame
print("Shape of the DataFrame:", df.shape)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
Shape of the DataFrame: (891, 15)

In [24]:
# Splitting DataFrame into two halves
from random import random
df1 = df.sample(frac=0.5, random_state=1)  # First half
df2 = df.drop(df1.index)  # Second half
# Display the first few rows of each half
print("First Half of DataFrame:")
print(df1.shape)
print(df1.head())

print("Second Half of DataFrame:")
print(df2.shape)
print(df2.head())

First Half of DataFrame:
(446, 15)
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
862         1       1  female  48.0      0      0  25.9292        S   First
223         0       3    male   NaN      0      0   7.8958        S   Third
84          1       2  female  17.0      0      0  10.5000        S  Second
680         0       3  female   NaN      0      0   8.1375        Q   Third
535         1       2  female   7.0      0      2  26.2500        S  Second

       who  adult_male deck  embark_town alive  alone
862  woman       False    D  Southampton   yes   True
223    man        True  NaN  Southampton    no   True
84   woman       False  NaN  Southampton   yes   True
680  woman       False  NaN   Queenstown    no   True
535  child       False  NaN  Southampton   yes  False
Second Half of DataFrame:
(445, 15)
    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1          1       1  female  38.0      1      0  71.2833        C   First
7          0       3    male   2.0      3      1  21.0750        S   Third
10         1       3  female   4.0      1      1  16.7000        S   Third
15         1       2  female  55.0      0      0  16.0000        S  Second
18         0       3  female  31.0      1      0  18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
1   woman       False    C    Cherbourg   yes  False
7   child       False  NaN  Southampton    no  False
10  child       False    G  Southampton   yes  False
15  woman       False  NaN  Southampton   yes   True
18  woman       False  NaN  Southampton    no  False

# Joining Two Datasets

In [25]:
dff = pd.concat([df1, df2], ignore_index=True)  # Concatenate the two halves
# Display the shape of the concatenated DataFrame
print("Concatenated DataFrame Shape:", dff.shape)
# Display the first few rows of the concatenated DataFrame
print("Concatenated DataFrame:", dff.head())

Concatenated DataFrame Shape: (891, 15)
Concatenated DataFrame:    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         1       1  female  48.0      0      0  25.9292        S   First
1         0       3    male   NaN      0      0   7.8958        S   Third
2         1       2  female  17.0      0      0  10.5000        S  Second
3         0       3  female   NaN      0      0   8.1375        Q   Third
4         1       2  female   7.0      0      2  26.2500        S  Second

     who  adult_male deck  embark_town alive  alone
0  woman       False    D  Southampton   yes   True
1    man        True  NaN  Southampton    no   True
2  woman       False  NaN  Southampton   yes   True
3  woman       False  NaN   Queenstown    no   True
4  child       False  NaN  Southampton   yes  False

# Filtering in a Dataset

In [26]:
df = sns.load_dataset("titanic")
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [27]:
# To check unique values in a sex column
df["sex"].unique()

array(['male', 'female'], dtype=object)

In [28]:
# Select only data of males
df_males = df[df["sex"] == "male"]
print(df_males.head())

   survived  pclass   sex   age  sibsp  parch     fare embarked  class    who  \
0         0       3  male  22.0      1      0   7.2500        S  Third    man
4         0       3  male  35.0      0      0   8.0500        S  Third    man
5         0       3  male   NaN      0      0   8.4583        Q  Third    man
6         0       1  male  54.0      0      0  51.8625        S  First    man
7         0       3  male   2.0      3      1  21.0750        S  Third  child

   adult_male deck  embark_town alive  alone
0        True  NaN  Southampton    no  False
4        True  NaN  Southampton    no   True
5        True  NaN   Queenstown    no   True
6        True    E  Southampton    no   True
7       False  NaN  Southampton    no  False

In [29]:
# Select the passengers who are from Southampton
df[df["embark_town"] == "Southampton"].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True

In [30]:
# Select the passengers who are females that are 35 years old and from Southampton or Queenstown
df[(df["sex"] == "female") & (df["age"] == 35) & (df["embark_town"].isin(["Southampton", "Queenstown"]))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
211,1,2,female,35.0,0,0,21.0000,S,Second,woman,False,NaN,Southampton,yes,True
230,1,1,female,35.0,1,0,83.4750,S,First,woman,False,C,Southampton,yes,False
269,1,1,female,35.0,0,0,135.6333,S,First,woman,False,C,Southampton,yes,True
279,1,3,female,35.0,1,1,20.2500,S,Third,woman,False,NaN,Southampton,yes,False
383,1,1,female,35.0,1,0,52.0000,S,First,woman,False,NaN,Southampton,yes,False
486,1,1,female,35.0,1,0,90.0000,S,First,woman,False,C,Southampton,yes,False

In [31]:
df.embark_town.value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [32]:
df.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

# Splitting a string into different columns

In [33]:
df = pd.DataFrame({"name":["Asad Ali","Ali Zain","Faisal Iqbal","Iqbal Akram","Shoaib Idrees"],"location":["Okara Pakistan","Nankana Pakistan","Pattoki Pakistan","Lahore Pakistan","Bseerpur Pakistan"]})
df

            name           location
0       Asad Ali     Okara Pakistan
1       Ali Zain   Nankana Pakistan
2   Faisal Iqbal   Pattoki Pakistan
3    Iqbal Akram    Lahore Pakistan
4  Shoaib Idrees  Bseerpur Pakistan

In [34]:
# Splitting a string name column into first and last name
df[['First_name', 'Last_name']] = df['name'].str.split(' ', n=1, expand=True)
df[["City","Country"]] = df["location"].str.split(" ", n=1, expand=True)
df

            name           location First_name Last_name      City   Country
0       Asad Ali     Okara Pakistan       Asad       Ali     Okara  Pakistan
1       Ali Zain   Nankana Pakistan        Ali      Zain   Nankana  Pakistan
2   Faisal Iqbal   Pattoki Pakistan     Faisal     Iqbal   Pattoki  Pakistan
3    Iqbal Akram    Lahore Pakistan      Iqbal     Akram    Lahore  Pakistan
4  Shoaib Idrees  Bseerpur Pakistan     Shoaib    Idrees  Bseerpur  Pakistan

In [35]:
# Making a copy of the DataFrame
df = df[["First_name","Last_name","City","Country"]]
print(df.head())

  First_name Last_name      City   Country
0       Asad       Ali     Okara  Pakistan
1        Ali      Zain   Nankana  Pakistan
2     Faisal     Iqbal   Pattoki  Pakistan
3      Iqbal     Akram    Lahore  Pakistan
4     Shoaib    Idrees  Bseerpur  Pakistan

# Aggregate by multiple groups/functions

In [36]:
df = sns.load_dataset("titanic")
# Display the first few rows of the DataFrame
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [37]:
# Group the DataFrame by the "who" column and count the number of non-null values in each column for each group
df.groupby("who").count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [38]:
# Group the DataFrame by the "sex" and "embark_town" columns,
# and count the number of non-null values in each column for each group
print(df.groupby(["sex", "embark_town"]).count())

                    survived  pclass  age  sibsp  parch  fare  embarked  \
sex    embark_town
female Cherbourg          73      73   61     73     73    73        73
       Queenstown         36      36   12     36     36    36        36
       Southampton       203     203  186    203    203   203       203
male   Cherbourg          95      95   69     95     95    95        95
       Queenstown         41      41   16     41     41    41        41
       Southampton       441     441  368    441    441   441       441

                    class  who  adult_male  deck  alive  alone
sex    embark_town
female Cherbourg       73   73          73    37     73     73
       Queenstown      36   36          36     2     36     36
       Southampton    203  203         203    56    203    203
male   Cherbourg       95   95          95    32     95     95
       Queenstown      41   41          41     2     41     41
       Southampton    441  441         441    72    441    441

# How to select specific rows and columns

In [39]:
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [40]:
# To select a specific column in a dataset
df[["sex","age"]].head()

      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [41]:
# To get the min max of numeric columns
df.describe().loc[["min","max"]]

     survived  pclass    age  sibsp  parch      fare
min       0.0     1.0   0.42    0.0    0.0    0.0000
max       1.0     3.0  80.00    8.0    6.0  512.3292

In [42]:
# To get the statistical summary of the DataFrame
print(df.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [43]:
# Another way to get the statistical summary of the DataFrame
print(df.describe().loc["min":"max"])

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
50%       0.0     3.0  28.000    0.0    0.0   14.4542
75%       1.0     3.0  38.000    1.0    0.0   31.0000
max       1.0     3.0  80.000    8.0    6.0  512.3292

# Reshape Multi Index Series

In [44]:
# Load titanic dataset using seaborn
df = sns.load_dataset("titanic")
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [45]:
# Calculate and display the mean value of the 'survived' column
print("Mean of survived column:", df["survived"].mean())

# Calculate and display the mean value of the 'survived' column for male passengers
print("Mean of survived column of males:", df[df["sex"] == "male"]["survived"].mean())

# Group the data by 'sex' and 'pclass', and calculate the mean survival rate for each group
print("Mean survival rate by sex and class:", df.groupby(['sex', 'pclass']).survived.mean())

Mean of survived column: 0.3838383838383838
Mean of survived column of males: 0.18890814558058924
Mean survival rate by sex and class: sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

# Numeric to Categoric Feature Conversion

In [46]:
print(df.age.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [47]:
# Creating the Bins of Age and Add a new column 'new_age' to the DataFrame
df["new_age"] = pd.cut(df.age, bins=[0,18,25,50,99], labels=["Child","Young_Adult","Adult","Old"])
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone      new_age
0    man        True  NaN  Southampton    no  False  Young_Adult
1  woman       False    C    Cherbourg   yes  False        Adult
2  woman       False  NaN  Southampton   yes   True        Adult
3  woman       False    C  Southampton   yes  False        Adult
4    man        True  NaN  Southampton    no   True        Adult

In [48]:
# Check the unique values in the new_age column
print("Unique values and thier sum in new_age column:")
print(df["new_age"].value_counts())

Unique values and thier sum in new_age column:
new_age
Adult          349
Young_Adult    162
Child          139
Old             64
Name: count, dtype: int64

# How to Convert One set of values into another One

In [49]:
# Look at the first few rows of the age column in theDataFrame
print(df["sex"].head())

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [50]:
df["sex_num"] = df["sex"].map({"male": 0, "female": 1})
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone      new_age  sex_num
0    man        True  NaN  Southampton    no  False  Young_Adult        0
1  woman       False    C    Cherbourg   yes  False        Adult        1
2  woman       False  NaN  Southampton   yes   True        Adult        1
3  woman       False    C  Southampton   yes  False        Adult        1
4    man        True  NaN  Southampton    no   True        Adult        0

In [51]:
# Checking the unique values in embark_town column
print(df["embark_town"].unique())

['Southampton' 'Cherbourg' 'Queenstown' nan]

In [52]:
# The following code converts the 'embark_town' categorical column into numeric values using factorize().
# It creates a new column 'embark_town_value' with the numeric codes.


df["embark_town_value"] = df.embark_town.factorize()[0]
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone      new_age  sex_num  \
0    man        True  NaN  Southampton    no  False  Young_Adult        0
1  woman       False    C    Cherbourg   yes  False        Adult        1
2  woman       False  NaN  Southampton   yes   True        Adult        1
3  woman       False    C  Southampton   yes  False        Adult        1
4    man        True  NaN  Southampton    no   True        Adult        0

   embark_town_value
0                  0
1                  1
2                  0
3                  0
4                  0

In [53]:
print(df["embark_town"].value_counts())
print(df["embark_town_value"].value_counts())

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64
embark_town_value
 0    644
 1    168
 2     77
-1      2
Name: count, dtype: int64

# How to get Transpose of a wide dataframe

In [58]:
# Creating a wide Dataframe
df = pd.DataFrame(np.random.rand(400, 26), columns=list("ABCDEFGHIJKLMNOPQRSTUVWXYZ"))
print(df.head())

          A         B         C         D         E         F         G  \
0  0.341168  0.616518  0.873079  0.455924  0.481180  0.705164  0.627496
1  0.630757  0.331293  0.662406  0.982054  0.447248  0.195136  0.938368
2  0.564987  0.650743  0.643370  0.331433  0.656953  0.450161  0.295262
3  0.350649  0.876750  0.554441  0.852769  0.962504  0.918509  0.727497
4  0.494858  0.178998  0.776991  0.265485  0.088519  0.843035  0.101376

          H         I         J  ...         Q         R         S         T  \
0  0.011001  0.855068  0.518703  ...  0.293306  0.205672  0.010637  0.374104
1  0.647155  0.292898  0.271481  ...  0.127569  0.329981  0.730657  0.661564
2  0.231276  0.166548  0.651078  ...  0.538191  0.798245  0.248265  0.751442
3  0.220705  0.898537  0.037832  ...  0.460372  0.298839  0.087027  0.912799
4  0.581116  0.643525  0.743861  ...  0.685380  0.395505  0.332618  0.162397

          U         V         W         X         Y         Z
0  0.055131  0.217205  0.863592  0.693841  0.144294  0.454046
1  0.916416  0.103824  0.192584  0.328797  0.860109  0.641860
2  0.651637  0.891762  0.748343  0.823038  0.812815  0.184401
3  0.850515  0.202683  0.513210  0.880552  0.307766  0.445812
4  0.594388  0.948638  0.515531  0.343334  0.917935  0.241294

[5 rows x 26 columns]

In [ ]:
# Shape of Dataframe
df.shape

(400, 26)

In [64]:
# Transposing the DataFrame
print(df.head(5).T)

          0         1         2         3         4
A  0.341168  0.630757  0.564987  0.350649  0.494858
B  0.616518  0.331293  0.650743  0.876750  0.178998
C  0.873079  0.662406  0.643370  0.554441  0.776991
D  0.455924  0.982054  0.331433  0.852769  0.265485
E  0.481180  0.447248  0.656953  0.962504  0.088519
F  0.705164  0.195136  0.450161  0.918509  0.843035
G  0.627496  0.938368  0.295262  0.727497  0.101376
H  0.011001  0.647155  0.231276  0.220705  0.581116
I  0.855068  0.292898  0.166548  0.898537  0.643525
J  0.518703  0.271481  0.651078  0.037832  0.743861
K  0.943209  0.559847  0.315802  0.093768  0.643451
L  0.594810  0.472309  0.305856  0.544249  0.149985
M  0.793060  0.904108  0.160458  0.112206  0.653428
N  0.473050  0.431263  0.909467  0.755685  0.633583
O  0.276476  0.404399  0.971518  0.134920  0.427567
P  0.101677  0.452619  0.722424  0.431445  0.497897
Q  0.293306  0.127569  0.538191  0.460372  0.685380
R  0.205672  0.329981  0.798245  0.298839  0.395505
S  0.010637  0.730657  0.248265  0.087027  0.332618
T  0.374104  0.661564  0.751442  0.912799  0.162397
U  0.055131  0.916416  0.651637  0.850515  0.594388
V  0.217205  0.103824  0.891762  0.202683  0.948638
W  0.863592  0.192584  0.748343  0.513210  0.515531
X  0.693841  0.328797  0.823038  0.880552  0.343334
Y  0.144294  0.860109  0.812815  0.307766  0.917935
Z  0.454046  0.641860  0.184401  0.445812  0.241294

In [66]:
# Get the statistical summary of the Dataframe
df.describe()
print(df.describe())

                A           B           C           D           E           F  \
count  400.000000  400.000000  400.000000  400.000000  400.000000  400.000000
mean     0.484261    0.513876    0.504716    0.492790    0.502330    0.529610
std      0.300254    0.289367    0.296583    0.284042    0.290841    0.293960
min      0.001503    0.000272    0.001967    0.002319    0.000012    0.001876
25%      0.208658    0.277467    0.238306    0.245884    0.263168    0.280904
50%      0.487678    0.499938    0.498585    0.502459    0.498962    0.544777
75%      0.751218    0.771143    0.777002    0.717763    0.746438    0.795337
max      0.998593    0.998133    0.997637    0.999388    0.999126    0.999612

                G           H           I           J  ...           Q  \
count  400.000000  400.000000  400.000000  400.000000  ...  400.000000
mean     0.476792    0.472836    0.490954    0.506274  ...    0.490667
std      0.291503    0.296670    0.293686    0.273938  ...    0.286031
min      0.000086    0.000081    0.001148    0.004546  ...    0.002697
25%      0.221742    0.223412    0.232073    0.274148  ...    0.248295
50%      0.471282    0.450945    0.487531    0.500925  ...    0.496889
75%      0.732994    0.721544    0.744521    0.729884  ...    0.733035
max      0.999141    0.999916    0.997082    0.997029  ...    0.991599

                R           S           T           U           V           W  \
count  400.000000  400.000000  400.000000  400.000000  400.000000  400.000000
mean     0.496380    0.485327    0.506373    0.474897    0.514905    0.486954
std      0.299881    0.292853    0.280468    0.290718    0.294502    0.285670
min      0.006146    0.000700    0.002657    0.003484    0.002244    0.000015
25%      0.231560    0.228690    0.260234    0.226851    0.240786    0.248421
50%      0.490962    0.478560    0.504811    0.458932    0.546213    0.458111
75%      0.759753    0.732244    0.743445    0.719978    0.778260    0.731811
max      0.998568    0.994938    0.999060    0.999148    0.993953    0.996268

                X           Y           Z
count  400.000000  400.000000  400.000000
mean     0.496154    0.505893    0.504021
std      0.290557    0.293719    0.276691
min      0.000577    0.000599    0.001162
25%      0.243074    0.240944    0.270915
50%      0.482129    0.495476    0.505123
75%      0.736651    0.753899    0.743309
max      0.999505    0.999981    0.998471

[8 rows x 26 columns]

In [67]:
# Get the transpose  statistical summary of the Dataframe
df.describe()
print(df.describe().T)

   count      mean       std       min       25%       50%       75%       max
A  400.0  0.484261  0.300254  0.001503  0.208658  0.487678  0.751218  0.998593
B  400.0  0.513876  0.289367  0.000272  0.277467  0.499938  0.771143  0.998133
C  400.0  0.504716  0.296583  0.001967  0.238306  0.498585  0.777002  0.997637
D  400.0  0.492790  0.284042  0.002319  0.245884  0.502459  0.717763  0.999388
E  400.0  0.502330  0.290841  0.000012  0.263168  0.498962  0.746438  0.999126
F  400.0  0.529610  0.293960  0.001876  0.280904  0.544777  0.795337  0.999612
G  400.0  0.476792  0.291503  0.000086  0.221742  0.471282  0.732994  0.999141
H  400.0  0.472836  0.296670  0.000081  0.223412  0.450945  0.721544  0.999916
I  400.0  0.490954  0.293686  0.001148  0.232073  0.487531  0.744521  0.997082
J  400.0  0.506274  0.273938  0.004546  0.274148  0.500925  0.729884  0.997029
K  400.0  0.505335  0.285243  0.001222  0.280320  0.523371  0.743092  0.997568
L  400.0  0.497006  0.287904  0.003670  0.246275  0.509434  0.746531  0.998474
M  400.0  0.488247  0.291446  0.001452  0.220292  0.467276  0.757326  0.998777
N  400.0  0.498605  0.283312  0.000876  0.255307  0.521226  0.738751  0.987489
O  400.0  0.506580  0.290538  0.000015  0.251517  0.512020  0.743784  0.999708
P  400.0  0.484924  0.300303  0.000220  0.206846  0.483128  0.759735  0.996929
Q  400.0  0.490667  0.286031  0.002697  0.248295  0.496889  0.733035  0.991599
R  400.0  0.496380  0.299881  0.006146  0.231560  0.490962  0.759753  0.998568
S  400.0  0.485327  0.292853  0.000700  0.228690  0.478560  0.732244  0.994938
T  400.0  0.506373  0.280468  0.002657  0.260234  0.504811  0.743445  0.999060
U  400.0  0.474897  0.290718  0.003484  0.226851  0.458932  0.719978  0.999148
V  400.0  0.514905  0.294502  0.002244  0.240786  0.546213  0.778260  0.993953
W  400.0  0.486954  0.285670  0.000015  0.248421  0.458111  0.731811  0.996268
X  400.0  0.496154  0.290557  0.000577  0.243074  0.482129  0.736651  0.999505
Y  400.0  0.505893  0.293719  0.000599  0.240944  0.495476  0.753899  0.999981
Z  400.0  0.504021  0.276691  0.001162  0.270915  0.505123  0.743309  0.998471

# Reshaping a Dataframe

In [69]:
# Creating a Dataframe

distance = pd.DataFrame([["12345",100,200,300],["34567",400,500,600],["67890",700,800,900]], columns=["zip","factory","warehouse","retail"])
print(distance)

     zip  factory  warehouse  retail
0  12345      100        200     300
1  34567      400        500     600
2  67890      700        800     900

In [70]:
# Transposing the Dataframe.
print(distance.T)

               0      1      2
zip        12345  34567  67890
factory      100    400    700
warehouse    200    500    800
retail       300    600    900

In [ ]:
# Creating the Dataframe
distance2 = pd.DataFrame([["1","12345","factory"],["2","34567","warehouse"]],columns=['user_id',"zip","location_type"])
print(distance2)

  user_id    zip location_type
0       1  12345       factory
1       2  34567     warehouse

In [72]:
# Transposing the Dataframe
print(distance2.T)

                     0          1
user_id              1          2
zip              12345      34567
location_type  factory  warehouse